## **Pandas 51 - Seleksi Baris dengan between**

### Import Modules

In [18]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.1
1.24.2

### Persiapan Data Frame

In [19]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  6  7  3  4
1  3  6  3  5  2
2  5  4  6  9  6
3  9  3  2  8  9
4  5  5  1  6  8
5  6  5  8  6  5
6  9  5  9  1  2
7  5  3  7  9  8
8  3  9  8  9  5
9  5  7  4  3  5

### Seleksi baris dengan between()

In [20]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
1  3  6  3  5  2
2  5  4  6  9  6
4  5  5  1  6  8
7  5  3  7  9  8
8  3  9  8  9  5
9  5  7  4  3  5

In [21]:
# Menggunakan between dengan inklusi 'left' dan 'right' untuk kolom 'A' antara 2 dan 5
result_left = df[df['A'].between(2, 5, inclusive='left')]
result_right = df[df['A'].between(2, 5, inclusive='right')]

result_left
result_right

   A  B  C  D  E
1  3  6  3  5  2
2  5  4  6  9  6
4  5  5  1  6  8
7  5  3  7  9  8
8  3  9  8  9  5
9  5  7  4  3  5